/*
Определить конструктор с двумя параметрами целого типа – размерность матрицы, который можно использовать как конструктор умолчания. 
Определить конструктор, который создаёт новую матрицу таким образом, что все её элементы больше элементов другой матрицы на заданное число, 
и который можно использовать как конструктор копирования. 
Определить деструктор. Определить преобразования из переменной типа double в матрицу – заполнение матрицы и из матрицы в переменную типа 
double – среднее арифметическое элементов матрицы.
*/
using System;
namespace laba3
{
    public static class Program
    {
        public static void Main()
        {
            Console.WriteLine("Laba3");
        }
    }
}